app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @products = ProductDecorator.decorate_collection(Product.all)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def show
    @product = ProductDecorator.new(Product.find(params[:id]))

SELECT `products`.* FROM `products`
INSERT INTO `products` (`name`, `price`, `color`, `product_status`, `inward_date`, `product_type`, `description`, `created_at`, `updated_at`) VALUES ('dfsdf', 23.0, 'sdsd', 1, '2017-08-09', 'Pen', 'sdsdsd', '2017-08-09 17:48:52', '2017-08-09 17:48:52')
---
  def create
    @products = ProductDecorator.decorate_collection(Product.all)
    @product = Product.create(product_params)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def edit
    @product = ProductDecorator.new(Product.find(params[:id]))

SELECT `products`.* FROM `products`
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `price` = 50.0, `color` = 'pink', `description` = 'new peoduct', `updated_at` = '2017-08-13 15:48:25' WHERE `products`.`id` = 6
---
  def update
    @products = ProductDecorator.decorate_collection(Product.all)
    @product = ProductDecorator.new(Product.find(params[:id]))

    @product.update_attributes(product_params)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
---
  def delete
    @product = ProductDecorator.new(Product.find(params[:product_id]))

SELECT `products`.* FROM `products`
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 2
---
  def destroy
    @products = ProductDecorator.decorate_collection(Product.all)
    @product = ProductDecorator.new(Product.find(params[:id]))
    @product.destroy